#!/usr/bin/python
# -*- coding: utf-8 -*-
list = [
  [4, u'“龍殺し”ヴォルグ'],
  [5, u'鉄仮面の剣士アルヴェルト'],
  [7, u'黒き鋭刃リュビア'],
  [9, u'百戦の勇士スレイ'],
  [10, u'無敵の守銭奴メリッサ'],
  [11, u'みならい戦士エディ'],
  [12, u'復讐に燃える戦士グレッグ'],
  [13, u'自称英雄 アルベルト'],
  [15, u'微笑む悪魔アンジェリカ'],
  [17, u'お調子者フランツ'],
  [19, u'森の王者フィリップ'],
  [20, u'王都の勇士キリエ'],
  [21, u'魔境の案内人エマ'],
  [22, u'万象の魔導師アルドラ'],
  [23, u'破壊魔人ロレッタ'],
  [24, u'死の商人アイアリス'],
  [25, u'熱血武器商人ダスティ'],
  [26, u'うら若き商才エンヴィ'],
  [27, u'慈悲の商人パトリシア'],
  [29, u'法務委員ビルギット'],
  [31, u'秘薬師メルヴィナ'],
  [32, u'魔法弓士コロナ'],
  [34, u'熱き癒し手マリナ'],
  [36, u'白の癒し手ラティ'],
  [37, u'俊足の剣士ラビィ'],
  [38, u'強運の戦士ニンファ'],
  [39, u'不良治癒術師ヴァネッサ'],
  [40, u'善良なる傭兵カイン'],
  [41, u'頼れる弓兵ミシディア'],
  [42, u'飛天の遊撃手ジグムント'],

  [53, u'早撃ちの狩人ワーグマン'],
  [1002, u'聖王女ユリアナ'],
  [1009, u'司祭騎士パーシェル'],
  [1010, u'旅の聖騎士ライネル'],
  [1011, u'旅の聖騎士カイ'],
  [1014, u'“原初の鷹”騎士団長ハーマン'],
  [1019, u'隠密神官ヨハン'],
  [1020, u'トラブルシスターケイト'],
  [1022, u'放浪牧師ロイ'],
  [1024, u'若き聖騎士マリス'],
  [1026, u'“吸血の戦鬼”騎士団長ベアトリクス'],
  [1027, u'“悠久の丘”騎士団エリーナ'],
  [1028, u'神託の聖騎士オデット'],
  [1031, u'“清廉の泉”騎士団ルアンナ'],
  [2006, u'二ツ星教授ヨナ'],
  [2007, u'平凡なるメイドエレミア'],
  [2015, u'魔法兵団フィオナ'],
  [2023, u'双子魔法使いパルナ'],
  [2024, u'双子魔法使いプルナ'],
  [2025, u'魔法学園用務員ウーヴィア'],
  [3008, u'土妖精の商売人アイダ'],
  [3012, u'土妖精戦士団リンダ'],
  [3017, u'炎の戦士ファン=ファン'],
  [3021, u'泣き虫火妖精ヨヨ'],
  [4009, u'人気詩人ナイエル'],
  [4011, u'みならい吟遊詩人ハキム'],
  [4015, u'踊り子見習いニキ'],
  [4019, u'占い師ネルヴァ'],
  [4027, u'賭博師メフラム'],
  [4031, u'女怪盗マディーナ'],
  [5007, u'銀狼の導き手バリエナ'],
  [5014, u'千河の勇士ハジャダ'],
  [5022, u'桜の樹人セレージャ'],

  [5024, u'雪山の樹人パポラ'],
  [5028, u'精霊の導きミニモ'],
  [6014, u'歌舞伎者イヌチヨ'],
  [6021, u'赤鬼の剣士バイセツ'],
  [6024, u'宿命の剣士ハルアキ'],
  [6025, u'宿命の剣士トウカ'],
  [7009, u'復讐者クラリス'],
  [7010, u'恋するお嬢様ベルナデット'],
  [7011, u'盲目の神官ノエル'],
  [7015, u'主人公'],
  [7504, u'牢獄の魔神コロパティロン'],
  [-1, u'ぬるい炎キキ'],
  [-1, u'刀匠ヨルデ'],
  [-1, u'山猫の使いリンセ'],
  [-1, u'聖騎士団長“聖光の向日葵”リフレット'],
  [-1, u'聖騎士団長“聖域の守り手”ウェイン'],
  [-1, u'砂漠の鷹ジャファール'],

  [-1, u'無垢の暗殺者ニーナ'],
  [-1, u'詩を紡ぐ者ファルリン'],
  [-1, u'砂漠のアイドルサーシャ'],
  [-1, u'冒涜の魔神カタリス'],
  [-1, u'千河の遊撃手ブリサ'],
  [-1, u'魔法兵団隊長ユニ'],
  [-1, u'魔法兵団師団長ヴェルナー'],
  [-1, u'魔法兵団師団長カティア'],
  [-1, u'氷の魔導人形イスレム'],
  [-1, u'候補生イザベル'],
  [-1, u'候補生カレン'],
  [-1, u'候補生チアリー'],
  [-1, u'年代記の少女フィーナ'],
  [-1, u'二刀の剣士イオ'],


  [-1, u'土妖精戦士団隊長エルダ'],

  [-1, u'職人見習いアイナ'],
  [-1, u'みならい吟遊詩人ハサン'],
  [-1, u'背徳の聖騎士イルヘルミナ'],
  [-1, u'白百合の聖騎士ローエンディア'],
  [-1, u'湖都の大盗賊ムスタファ'],
  [-1, u'聖騎士団長“聖戦の呼び声”ダナディ'],
  [-1, u'千河の戦士ティフォ'],
  [-1, u'魔法兵団隊長フェブリア'],
  [-1, u'二ツ星教授イザヤ'],
  [-1, u'三ツ星教授メラヒム'],
  [-1, u'炎の申し子フィ=フィ'],


  [-1, u'孔雀の使いパボア'],
  [-1, u'候補生ルカナ'],
  [-1, u'候補生レベッカ'],
  [-1, u'千河の奏者ミラジェン'],
  [-1, u'千河の指揮官ビエンタ'],
  [-1, u'花の司祭アリエッタ'],
  [-1, u'医術師オリアーナ'],
  [-1, u'神秘の歌姫ライラ'],
  [-1, u'聖都の良心アデル'],


  [-1, u'鋼の傭兵ドドガル'],
  [-1, u'情熱の舞姫マレイカ'],
  [-1, u'千河の戦士トルナド'],
  [-1, u'千河の戦士ジェアダ'],
  [-1, u'お騒がせ三姉妹ディエス'],
  [-1, u'“不変の勝利”騎士団トーマス'],
  [-1, u'枯れぬ者ラヒーム'],
  [-1, u'惑わぬ者カディル'],
  [-1, u'弓職人シェダ'],
  [-1, u'仮面の暗殺者フェイスレス'],
  [-1, u'お気楽奏者チャム=チャム'],
  [-1, u'お騒がせ三姉妹ミル'],
  [-1, u'お騒がせ三姉妹シエン'],
  [-1, u'聖霊の導きミニモ'],
  [-1, u'死出の案内人アイザック'],
  [-1, u'蛇つかいゴルネッサ'],
  [-1, u'炎の料理人トト'],
  [-1, u'魔法兵団隊長クラウス'],



  [-1, u'巡回者の探検家マルガ'],
  [-1, u'楽器職人デンガル'],
  [-1, u'軽業師メア'],
  [-1, u'千河の戦士ライオ'],




  [-1, u'陽光の者ギスゴ'],


  [-1, u'森外の理解者サビオ'],



  [-1, u'魔法兵団リーゼロッテ'],


  [-1, u'樹人ローザ'],

  [-1, u'軽足の傭兵カルロ'],

  [-1, u'土妖精戦士団エイダル'],
  [-1, u'土妖精戦士団ジャンダル'],

  [-1, u'土妖精の学者ローデル'],
  [-1, u'歴戦の女傭兵ロベルタ'],
  [-1, u'軟派騎士ナックル'],

  [-1, u'“鋼鉄の血”騎士団長バクストン'],

  [-1, u'聖都の宿将セルバンテス'],

  [-1, u'新米騎士アントン'],

  [-1, u'外交委員オットー'],
  [-1, u'魔法使い傭兵チャーノ'],
  [-1, u'魔導ギルド団員ゲッベルツ'],
  [-1, u'穴掘り師カルデア'],
  [-1, u'小間使いヨッタ=ヨッタ'],
  [-1, u'魔法学園生徒ミーナ'],
  [-1, u'魔法学園生徒クリスティン'],

  [-1, u'若き癒し手カトリ'],
]

def i2n( id ):
  for gacha in list:
    if gacha[0] == id:
      return gacha[1].encode("utf-8")
    elif gacha[0] == -1:
      return id
  return id